import React from "react";
import { Link } from "react-router-dom"; 

function Aboutus() {
  return (
    <div className="about-container">
      <div className="about-hero">
        <img
          src="https://woodlab.gr/wp-content/uploads/2022/05/WoodLab_Background.jpg"
          alt="WoodLab Workshop"
        />
      </div>

      <div className="about-content">
        <h1>Λίγα λόγια για εμάς</h1>
        <div className="underline"></div>
        <p>
          Είμαστε ο Στέλιος και ο Μάριος Χαλκιαδακης και το WoodLab ειναι το
          εργαστήριο μας.Οι γνώσεις που μας μετέδωσε ο πατέρας μας Γιώργος,
          έχοντας πάνω απο 40 χρόνια εμπειρίας στην τέχνη της επιπλοποιίας και
          της ξυλουργικής, σε συνδυασμό φυσικά με την αγάπη μας για το ξύλο και
          το design αποτελούν τις βάσεις μας. Πατώντας σε αυτές γερά,
          συνεχίζουμε να εξελισσόμαστε αναζητώντας διαρκώς καινούργιες τεχνικές,
          ώστε να ανταποκρινόμαστε όλο και καλύτερα στις ανάγκες και της
          απαιτήσεις της εποχής μας, σεβόμενοι πάντοτε την τέχνη μας και τους
          ανθρώπους, που την εμπιστεύονται. Κατασκευάζουμε χειροποίητα έπιπλα
          κατά παραγγελία με γνώμονα την αντοχή, την ποιότητα, το στυλ και την
          διαχρονικότητα. Η πολύχρονη εμπειρία μας στην δημιουργία ξύλινων
          ειδικών κατασκευών σε ιδιωτικούς και επαγγελματικούς χώρους, μας
          καθιστά ικανούς να συμβάλλουμε με υψηλής αισθητικής δημιουργίες στην
          διαμόρφωση και την διακόσμηση του χώρου σας.
        </p>

        <div className="about-actions">
          <Link to="/contact" className="about-btn">
            Επικοινωνήστε μαζί μας
          </Link>
        </div>
      </div>
    </div>
  );
}

export default Aboutus;
